[
  {
    "id": 1,
    "title": "Your First Swap",
    "description": "Learn the fundamentals of decentralized finance by swapping one token for another on a leading Decentralized Exchange (DEX).",
    "learningObjective": "Understand how to use a DEX to trade assets without a centralized intermediary and how to manage gas fees.",
    "difficulty": "Easy",
    "icon": "swap-icon",
    "rewardDetails": {
      "type": "QP",
      "amount": 100,
      "description": "100 Quest Points"
    },
    "tutorialSteps": [
      "Go to the designated DEX partner platform.",
      "Connect your Web3 wallet (e.g., MetaMask).",
      "Select 'Quest Token A' (QTA) as the token you want to swap from.",
      "Select 'Quest Token B' (QTB) as the token you wish to receive.",
      "Enter an amount to swap and click the 'Swap' button.",
      "Your wallet will prompt you to confirm the transaction. Review the gas fees and confirm.",
      "Once the transaction is confirmed on the blockchain, come back here and click 'Verify Completion'!"
    ]
  },
  {
    "id": 2,
    "title": "Become a Liquidity Provider",
    "description": "Discover how to earn passive income by providing liquidity to a token pair in a liquidity pool.",
    "learningObjective": "Learn the concept of liquidity pools, impermanent loss, and how to stake LP tokens to earn trading fees.",
    "difficulty": "Medium",
    "icon": "pool-icon",
    "rewardDetails": {
      "type": "NFT_BADGE",
      "name": "Liquidity Master Badge",
      "imageUrl": "ipfs://bafkreiemv4h2r6t2fgrz64f333jsmsx62lqfaq2xrk476ggytq27l2spsu"
    },
    "tutorialSteps": [
      "Navigate to the 'Pool' section of the partner DEX.",
      "Select the QTA/QTB token pair.",
      "Deposit an equal value of both QTA and QTB into the pool.",
      "Approve the DEX to spend your tokens by signing the transaction in your wallet.",
      "Confirm the final transaction to add your liquidity. You will receive LP (Liquidity Provider) tokens in return.",
      "Return to DeFiQuest and verify your completion to claim your exclusive NFT badge."
    ]
  },
  {
    "id": 3,
    "title": "Stake Your Tokens",
    "description": "Learn about network security and earning rewards by staking tokens in a protocol's staking contract.",
    "learningObjective": "Understand the role of staking in Proof-of-Stake networks and DeFi protocols, and the concept of earning yield on your assets.",
    "difficulty": "Medium",
    "icon": "stake-icon",
    "rewardDetails": {
      "type": "QP",
      "amount": 250,
      "description": "250 Quest Points"
    },
    "tutorialSteps": [
      "Go to the staking page of our partner protocol.",
      "Connect your wallet.",
      "Choose the amount of 'Governance Token' (GOV) you wish to stake.",
      "Click 'Stake' and approve the transaction in your wallet.",
      "Once staked, your tokens are locked in the contract and will begin earning rewards.",
      "Come back here to verify your on-chain action and receive your Quest Points."
    ]
  }
]